app/controllers/fisicas_controller.rb

  def index
    @fisicas = Fisica.all.order(:nome)
---
SELECT "fisicas".* FROM "fisicas" ORDER BY "fisicas"."nome" ASC