app/controllers/fisicas_controller.rb

SELECT "fisicas".* FROM "fisicas"
---
  def index
    @fisicas = Fisica.all

INSERT INTO "fisicas" ("nome", "cpf", "telefone", "endereco", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "Camila"], ["cpf", "5165165"], ["telefone", "155165"], ["endereco", "wbeffuygef"], ["created_at", "2018-07-28 16:37:05.595883"], ["updated_at", "2018-07-28 16:37:05.595883"]]
---
  def create
    @fisica = Fisica.new(fisica_params)

    respond_to do |format|
      if @fisica.save

DELETE FROM "fisicas" WHERE "fisicas"."id" = $1  [["id", 3]]
---
  def destroy
    @fisica.destroy

SELECT  "fisicas".* FROM "fisicas" WHERE "fisicas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_fisica
      @fisica = Fisica.find(params[:id])